# StructuralStickSymbolLocation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralStickSymbolLocation Property
ParameterTypeId Class See Also
---
"Stick Symbol Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralStickSymbolLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralStickSymbolLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralStickSymbolLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace